Revit 2027 API
SpatialElementTag.HasElbow Property
 Identifies if the tag's leader has an elbow point or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasElbow { get; }
Public ReadOnly Property HasElbow As Boolean
	Get
public:
property bool HasElbow {
	bool get ();
}
member HasElbow : bool with get
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  There is no leader for this tag.
Remarks
 Straight leaders do not have elbow points. Use LeaderElbow to get or set elbow point.
See Also
Reference
SpatialElementTag Class
Autodesk.Revit.DB Namespace